'use strict';
// Написати цикли, які роблять наступне:
//
// 1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
let a1=20;
for(let b1=20.5;b1<=30;b1+=0.5){
    a1=a1+' '+b1;
}
console.log(a1)
// 2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
let a2=27;
for(let b2=10;b2<=100;b2+=10){
    console.log(`${b2} доларів коштує ${a2*b2} гривень`);
}
// 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let a3 = 65;
for(let b3=1;b3<=100;b3++){
    if (b3**2>a3) break;
    console.log(b3)
}
// 4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають
// інших дільників крім 1 і себе).
let a4=37;
let c4 = 0;
for (let b4=2;b4<=a4;b4++){
    if (a4%b4!==0) continue;
    c4++;
    }
c4 > 1 ? console.log('Ні, це не ціле число') : console.log('Так, це ціле число');
// 5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь.
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
let a5=729;
let b5 = 0;
for (;a5%3===0;) {
    a5/=3;
    b5++;
    }
a5===1 ? console.log(`Це число можна отримати, зведенням числа 3 у ступінь ${b5}`) : console.log('Це число не можна отримати зведенням числа 3 у деякий ступінь');
