'use strict';
// Написати цикли, які зможуть:

// //1 Вивести на сторінку в один рядок через кому числа від 10 до 20.
// let a = 10;
// for (let b = 11; b<=20; b++){
//     a=`${a},${b}`
// }
// console.log(a);
// //2 Вивести квадрати чисел від 10 до 20.
// for (let a=10;a<=20;a++){
//     console.log(a**2)
// }
// //3 Вивести таблицю множення на 7.
// let a3=7;
// for (let b3=1;b3<=10;b3++){
//     console.log(`${a3}*${b3}=`+a3*b3)
// }
// //4 Знайти суму всіх цілих чисел від 1 до 15.
// let a4=0
// for (let b4=0;b4<=15;b4++){
//     a4+=b4;
// }
// console.log(a4);
// //5 Знайти добуток усіх цілих чисел від 15 до 35.
// let a5=15n
// for (let b5=16n;b5<=35n;b5++){
//     a5*=b5;
// }
// console.log(a5);
// //6 Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// let a6=0;
// for(let b6=1;b6<=500;b6++){
//     a6+=b6;
// }
// console.log(a6/500)
// //7 Вивести суму лише парних чисел в діапазоні від 30 до 80.
// let a7=0;
// for(let b7=30;b7<=80;b7++){
//     if(b7%2!==0) continue;
//     a7+=b7;
// }
// console.log(a7)
// //8. Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// for(let b8=100;b8<=200;b8++){
//     if(b8%3!==0) continue;
//     console.log(b8);
// }

//9. Дано натуральне число. Знайти та вивести на сторінку всі його дільники.


//10. Визначити кількість його парних дільників.
//11. Знайти суму його парних дільників.


//12. Надрукувати повну таблицю множення від 1 до 10.
// for (let a12=2;a12<=10;a12++){
//     console.log(`----${a12}----`);
//     for(let b12=2;b12<=10;b12++){
//         console.log(`${a12}*${b12}=`,a12*b12)
// }}