'use strict';
// запитати у користувача рік народження;
// запитати в нього, в якому місті він живе;
// запитати його улюблений вид спорту.
//     При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
//
//     його вік;
// якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..."
// і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”,
// де місце точок – введене місто.
//
//     Частина №2
//
// Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих
// видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та
// прізвище чемпіона.
//
//
//
//     Все це має бути відображено в одному вікні (алерті).
//
//     Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення –
// “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження,
//     місто чи вид спорту.
let today = new Date();
let age = today.getFullYear()-prompt('Введіть свій рік народження');
let city = prompt('Введіть назву міста, в якому ви живете');
let sport= prompt('Введіть ваш улюблений вид спорту');

if (city==='Київ'){
let cityMessage = 'Ти живеш у столиці України'
} else if (city==='Вашингтон'){
    let cityMessage='Ти живеш у столиці США'
} else if (city==='Лондон'){
    let cityMessage='Ти живеш у столиці Англії'
} else {
    let cityMessage=`Ти живеш у місті ${city}`
}

alert(age, cityMessate);