'use strict';
// Написати цикли, які зможуть:
//
//1. Вивести на сторінку в один рядок через кому числа від 10 до 20.
//2. Вивести квадрати чисел від 10 до 20.
//3. Вивести таблицю множення на 7.
//4. Знайти суму всіх цілих чисел від 1 до 15.
//5. Знайти добуток усіх цілих чисел від 15 до 35.
//6. Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
//7. Вивести суму лише парних чисел в діапазоні від 30 до 80.
//8. Вивести всі числа в діапазоні від 100 до 200 кратні 3.
//9. Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
//10. Визначити кількість його парних дільників.
//11. Знайти суму його парних дільників.
//12. Надрукувати повну таблицю множення від 1 до 10.

//1
// let a = 10;
// for (let b = 11; b<=20; b++){
//     a=`${a},${b}`
// }
// console.log(a);
//2
for (let a=10;a<=20;a++){
    console.log(a**2)
}
//3
let a3=7;
for (let b3=1;b3<=10;b3++){
    console.log(`${a3}*${b3}=`+a3*b3)
}
//4
let a4=0
for (let b4=0;b4<=15;b4++){
    a4+=b4;

}
console.log(a4);